<a href="https://colab.research.google.com/github/andres-merino/PracticaBasesRalacionales/blob/main/Practica-I-BasesRelacionales.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<table style="border: none; border-collapse: collapse;">
    <tr>
        <td style="width: 20%; vertical-align: middle; padding-right: 10px;">
            <img src="https://i.imgur.com/nt7hloA.png" width="100">
        </td>
        <td style="width: 2px; text-align: center;">
            <font color="#0030A1" size="7">|</font><br>
            <font color="#0030A1" size="7">|</font>
        </td>
        <td>
            <p style="font-variant: small-caps;"><font color="#0030A1" size="5">
                <b>Escuela de Ciencias Físicas y Matemática</b>
            </font> </p>
            <p style="font-variant: small-caps;"><font color="#0030A1" size="4">
                Bases de datos relacionales &bull; Práctica I
            </font></p>
            <p style="font-style: oblique;"><font color="#0030A1" size="3">
                Andrés Merino &bull; 2024-02
            </font></p>
        </td>  
    </tr>
</table>

---
## <font color='264CC7'> Introducción </font>

Este notebook está diseñado como una guía introductoria para manipular bases de datos relacionales en Python. Se usarán los ejemplos dados en el libro "Matemáticas discretas" de Richard Johnsonbaug.

Los paquetes necesarios son:

In [2]:
# Paquetes necesarios
import pandas as pd
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())
import numpy as np

---
## <font color='264CC7'> Ejemplo </font>

### <font color='264CC7'> Datos </font>

Para los ejercicios se usarán las siguientes tablas de datos:

In [3]:
# Tabla 3.4.1 - JUGADOR
tablaJugador = pd.DataFrame({
    "Núm. identif.": [22012, 93831, 58199, 84341, 1180, 26710, 61049, 39826],
    "Nombre": ["Johnsonbaugh", "Glover", "Battey", "Cage", "Homer", "Score", "Johnsonbaugh", "Singleton"],
    "Posición": ["c", "j", "p", "c", "1b", "p", "j", "2b"],
    "Edad": [22, 24, 18, 30, 37, 22, 30, 31]
})

# Tabla 3.4.2 - ASIGNACIÓN
tablaAsignacion = pd.DataFrame({
    "NIP": [39826, 26710, 58199, 1180],
    "Equipo": ["Blue Sox", "Mutts", "Jackalopes", "Mutts"]
})

# Mostrar las tablas
print("Tabla JUGADOR:")
display(tablaJugador)
print("Tabla ASIGNACIÓN:")
display(tablaAsignacion)

Tabla JUGADOR:

   Núm. identif.        Nombre Posición  Edad
0          22012  Johnsonbaugh        c    22
1          93831        Glover        j    24
2          58199        Battey        p    18
3          84341          Cage        c    30
4           1180         Homer       1b    37
5          26710         Score        p    22
6          61049  Johnsonbaugh        j    30
7          39826     Singleton       2b    31

Tabla ASIGNACIÓN:

     NIP      Equipo
0  39826    Blue Sox
1  26710       Mutts
2  58199  Jackalopes
3   1180       Mutts

### <font color='264CC7'> Consultas </font>

#### <font color='264CC7'> Consulta 1 </font>

Consulta todos los jugadores con posición "c".

In [4]:
# Consulta: Jugadores con posición 'c'
tablaJugador.query("Posición == 'c'")

   Núm. identif.        Nombre Posición  Edad
0          22012  Johnsonbaugh        c    22
3          84341          Cage        c    30

In [9]:
# Consulta SQL: Jugadores con posición 'c'
consulta = """
SELECT * 
FROM tablaJugador 
WHERE 
    Posición = 'c'
"""
pysqldf(consulta)

   Núm. identif.        Nombre Posición  Edad
0          22012  Johnsonbaugh        c    22
1          84341          Cage        c    30

#### <font color='264CC7'> Consulta 2 </font>

Consulta todos los nombres y posiciones de los jugadores.

In [10]:
# Consulta: Nombres y posiciones de los jugadores.
tablaJugador[["Nombre", "Posición"]]

         Nombre Posición
0  Johnsonbaugh        c
1        Glover        j
2        Battey        p
3          Cage        c
4         Homer       1b
5         Score        p
6  Johnsonbaugh        j
7     Singleton       2b

In [11]:
# Consulta SQL: Nombres y posiciones de los jugadores.
consulta = """
SELECT Nombre, Posición
FROM tablaJugador
"""
pysqldf(consulta)

         Nombre Posición
0  Johnsonbaugh        c
1        Glover        j
2        Battey        p
3          Cage        c
4         Homer       1b
5         Score        p
6  Johnsonbaugh        j
7     Singleton       2b

#### <font color='264CC7'> Consulta 3 </font>

Consulta todos los jugadores de los equipos.

In [13]:
# Consulta: Jugadores de los equipos
tablaJugador.merge(tablaAsignacion, left_on="Núm. identif.", right_on="NIP")

   Núm. identif.     Nombre Posición  Edad    NIP      Equipo
0          58199     Battey        p    18  58199  Jackalopes
1           1180      Homer       1b    37   1180       Mutts
2          26710      Score        p    22  26710       Mutts
3          39826  Singleton       2b    31  39826    Blue Sox

In [14]:
# Consulta SQL: Jugadores de los equipos
consulta = """
SELECT *
FROM tablaJugador
INNER JOIN tablaAsignacion
ON 
    `Núm. identif.` = NIP
"""
pysqldf(consulta)

   Núm. identif.     Nombre Posición  Edad    NIP      Equipo
0          58199     Battey        p    18  58199  Jackalopes
1           1180      Homer       1b    37   1180       Mutts
2          26710      Score        p    22  26710       Mutts
3          39826  Singleton       2b    31  39826    Blue Sox

---
## <font color='264CC7'> Ejercicios </font>

Los ejercicios se toman de la sección 3.4 del libro "Matemáticas discretas" de Richard Johnsonbaug.

### <font color='264CC7'> Datos </font>

Los datos son los siguientes:

In [16]:
# Tabla 3.4.4 - EMPLEADO
tabla_empleado = pd.DataFrame({
    "Ident.": [1089, 5620, 9354, 9551, 3600, 285, 6684],
    "Nombre": ["Suzuki", "Kaminski", "Jones", "Ryan", "Beaulieu", "Schmidt", "Manacotti"],
    "Administrador": ["Zamora", "Jones", "Yu", "Washington", "Yu", "Jones", "Jones"]
})

# Tabla 3.4.5 - DEPARTAMENTO
tabla_departamento = pd.DataFrame({
    "Dept.": [23, 4, 96, 66],
    "Administrador": ["Jones", "Yu", "Zamora", "Washington"]
})

# Tabla 3.4.6 - PROVEEDOR
tabla_proveedor = pd.DataFrame({
    "Dept.": [4, 23, 4, 66, 4, 96, 96, 23],
    "Parte núm.": ["335B2", "2A", "8C200", "42C", "900", "20A8", "1199C", "772"],
    "Cantidad": [220, 14, 302, 3, 7720, 200, 296, 39]
})

# Tabla 3.4.7 - COMPRADOR
tabla_comprador = pd.DataFrame({
    "Nombre": [
        "United Supplies", "ABC Unlimited", "United Supplies", "JCN Electronics", "United Supplies",
        "ABC Unlimited", "Danny’s", "United Supplies", "Underhanded Sales", "Danny’s", "DePaul University", "ABC Unlimited"
    ],
    "Parte núm.": ["2A", "8C200", "1199C", "2A", "335B2", "772", "900", "772", "20A8", "20A8", "42C", "20A8"]
})

# Mostrar las tablas
print("Tabla EMPLEADO:")
display(tabla_empleado)
print("Tabla DEPARTAMENTO:")
display(tabla_departamento)
print("Tabla PROVEEDOR:")
display(tabla_proveedor)
print("Tabla COMPRADOR:")
display(tabla_comprador)

Tabla EMPLEADO:

   Ident.     Nombre Administrador
0    1089     Suzuki        Zamora
1    5620   Kaminski         Jones
2    9354      Jones            Yu
3    9551       Ryan    Washington
4    3600   Beaulieu            Yu
5     285    Schmidt         Jones
6    6684  Manacotti         Jones

Tabla DEPARTAMENTO:

   Dept. Administrador
0     23         Jones
1      4            Yu
2     96        Zamora
3     66    Washington

Tabla PROVEEDOR:

   Dept. Parte núm.  Cantidad
0      4      335B2       220
1     23         2A        14
2      4      8C200       302
3     66        42C         3
4      4        900      7720
5     96       20A8       200
6     96      1199C       296
7     23        772        39

Tabla COMPRADOR:

               Nombre Parte núm.
0     United Supplies         2A
1       ABC Unlimited      8C200
2     United Supplies      1199C
3     JCN Electronics         2A
4     United Supplies      335B2
5       ABC Unlimited        772
6             Danny’s        900
7     United Supplies        772
8   Underhanded Sales       20A8
9             Danny’s       20A8
10  DePaul University        42C
11      ABC Unlimited       20A8

### <font color='264CC7'> Consulta 1 </font>

Encuentre los nombres de todos los empleados. (No incluya a los
administradores).

In [ ]:
# Consulta:

In [ ]:
# Consulta SQL:

### <font color='264CC7'> Consulta 2 </font>

Encuentre los nombres de todos los empleados administrados por
Jones.

In [ ]:
# Consulta:

In [ ]:
# Consulta SQL:

### <font color='264CC7'> Consulta 3 </font>

Encuentre los números de partes y las cantidades compradas por
United Supplies.

In [ ]:
# Consulta:

In [ ]:
# Consulta SQL:

### <font color='264CC7'> Consulta 4 </font>

Encuentre los nombres de todos los empleados que trabajan en departamentos que suministran partes a JCN Electronics.

In [ ]:
# Consulta:

In [ ]:
# Consulta SQL:

### <font color='264CC7'> Consulta 5 </font>

Encuentre todos los números de partes y cantidades para el departamento
de Zamora.

In [ ]:
# Consulta:

In [ ]:
# Consulta SQL: